Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22J18A.PIC
      <edc:SFRDef edc:_addr="0x42003414" edc:access="--nn-nnn--nnn-nnnnnn-nnn-n-nnnn-" edc:cname="COMPCTRL1" edc:impl="0x373BF75E" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SINGLE" edc:desc="Single-Shot Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INTSEL" edc:desc="Interrupt Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="Interrupt on comparator output toggle" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Interrupt on comparator output rising" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Interrupt on comparator output falling" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="EOC" edc:desc="Interrupt on end of comparison (single-shot mode only)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input Mux Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD scaler" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Internal bandgap voltage" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input Mux Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="I/O pin 0" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PIN1" edc:desc="I/O pin 1" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PIN2" edc:desc="I/O pin 2" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PIN3" edc:desc="I/O pin 3" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="VSCALE" edc:desc="VDD Scaler" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap Inputs and Invert" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="Speed Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low speed" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEDLOW" edc:desc="Medium low speed" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MEDHIGH" edc:desc="Medium high speed" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High speed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HYSTEN" edc:desc="Hysteresis Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:desc="Hysteresis Level" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="HYST50" edc:desc="50mV" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HYST70" edc:desc="70mV" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HYST90" edc:desc="90mV" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HYST110" edc:desc="110mV" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLEN" edc:desc="Filter Length" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No filtering" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAJ3" edc:desc="3-bit majority function (2 of 3)" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MAJ5" edc:desc="5-bit majority function (3 of 5)" edc:when="(field &amp; 0x7) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT" edc:desc="Output" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The output of COMPn is not routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="The asynchronous output of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003418" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x42003420" edc:access="---------------------------rrrrr" edc:cname="SYNCBUSY" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINCTRL" edc:desc="WINCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL0" edc:desc="COMPCTRL 0 Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPCTRL1" edc:desc="COMPCTRL 1 Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003424" edc:offset="0x7DC"/>
      <edc:SFRDef edc:_addr="0x42003C00" edc:access="-----nnnnnnnn-nn-nnn--nn-nnnnnnn" edc:cname="CTRLA" edc:impl="0x7FB737F" edc:mclr="00000011110110000000000000000000" edc:nzwidth="0x20" edc:por="00000011110110000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUTY" edc:desc="Duty Ratio" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="1/2 duty" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="THIRD" edc:desc="1/3 duty" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="FOURTH" edc:desc="1/4 duty" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SIXTH" edc:desc="1/6 duty" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="1/8 duty" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WMOD" edc:desc="Waveform Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LP" edc:desc="Low Power Waveform Mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STD" edc:desc="Standard Waveform Mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="Clock Prescaler" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PRESC16" edc:desc="16" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC32" edc:desc="32" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PRESC64" edc:desc="64" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PRESC128" edc:desc="128" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:desc="Clock Divider" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIAS" edc:desc="Bias Setting" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="1/2 bias" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="THIRD" edc:desc="1/3 bias" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="FOURTH" edc:desc="1/4 bias" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XVLCD" edc:desc="External VLCD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRF" edc:desc="Power Refresh Frequency" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PR2000" edc:desc="2kHz" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PR1000" edc:desc="1kHz" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PR500" edc:desc="500Hz" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PR250" edc:desc="250Hz" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMFCS" edc:desc="Display Memory Update Frame Counter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FC0" edc:desc="Frame Counter 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FC1" edc:desc="Frame Counter 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FC2" edc:desc="Frame Counter 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="NFC" edc:desc="Frame Counter event to DMU is forced to 0" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRF" edc:desc="Reference Refresh Frequency" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="RR2000" edc:desc="2kHz" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RR1000" edc:desc="1kHz" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RR500" edc:desc="500Hz" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RR250" edc:desc="250Hz" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RR125" edc:desc="125Hz" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="RR62" edc:desc="62.5Hz" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
